Repository: davidacm/accessiblePassPrompt
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru, uk

source: password typed
ru: пароль введён
uk: введений пароль

source: Error: the focus has changed. For security reasons, the password was not typed.
ru: Ошибка: фокус изменился. По соображениям безопасности пароль не был введён.
uk: Помилка: фокус змінено. З міркувань безпеки пароль не було введено.

source: shows a dialog to type a password, this password will be typed in the password field
ru: показывает диалог ввода пароля, этот пароль будет помещён в поле пароль
uk: показує діалог для введення пароля, цей пароль буде введений у поле пароль

source: The dialog is already opened. Dialog is now closed, please try again.
ru: Диалог уже открыт. Теперь диалог закрыт, пожалуйста, повторите попытку.
uk: Діалог вже відкрито. Діалог закрито, спробуйте ще раз.

source: The current focused element is not an editable field
ru: Текущий элемент в фокусе не является редактором
uk: Поточний сфокусований елемент не є полем для редагування

source: Enter password. This dialog will be closed in %s seconds
ru: Введите пароль. Этот диалог закроется через %s секунд
uk: Введіть пароль. Цей діалог буде закрито через %s секунд

source: Enter the password. Ensure that no one is listening or viewing your password.
ru: Введите пароль. Убедитесь, что никто не подслушивает и не смотрит на экран.
uk: Введіть пароль. Переконайтеся, що ніхто не підслуховує і не бачить ваш пароль.

source: Show password
ru: Показать пароль
uk: Показати пароль

source: accessible Pass Prompt
ru: доступный ввод паролей
uk: доступне поле пароля

source: This add-on can show a dedicated dialog to enter a password in a text edit field. So, the user can review the password in an accessible way.
ru: Это дополнение может отображать специальный диалог для ввода пароля в защищённое поле. Таким образом, пользователь может просмотреть пароль доступным способом.
uk: Цей додаток може відображати спеціальний діалог для введення пароля в полі редагування тексту, щоб користувач міг переглянути пароль у доступний спосіб.
